Repository: aspnet/LibraryManager.Loc
Catalog: src/libman/MultilingualResources/libman.*.xlf
Languages: cs, de, pt_br, ru, zh_hans, zh_hant

# CacheCommandDesc
source: List or clean libman cache contents
cs: Vytvoří seznam obsahu mezipaměti libman nebo ho vyčistí.
de: Inhalte des libman-Caches auflisten oder bereinigen
pt_br: Lista ou limpa o conteúdo do cache libman
ru: Вывести список содержимого кэша libman или очистить это содержимое
zh_hans: 列出或清除 libman 缓存内容
zh_hant: 列出或清除 libman 快取內容

# CleanCommandDesc
source: Deletes all library files defined in libman.json from the project
cs: Odstraní z projektu všechny soubory knihoven, které jsou definovány v libman.json.
de: Hiermit werden alle in der Datei "libman.json" definierten Bibliotheksdateien aus dem Projekt gelöscht.
pt_br: Exclui do projeto todos os arquivos de biblioteca definidos no libman.json
ru: Удаляет из проекта все файлы библиотеки, определенные в файле libman.json
zh_hans: 从项目中删除 libman.json 中定义的所有库文件
zh_hant: 從專案刪除 libman.json 中定義的所有程式庫檔案

# CleanCommandRemarks
source: Deletes any folders that become empty after this operation.
cs: Odstraní všechny složky, které se po provedení této operace vyprázdní.
de: Hiermit werden alle Ordner gelöscht, die nach diesem Vorgang leer sind.
pt_br: Exclui todas as pastas que ficarem vazias após esta operação.
ru: Удаляет любые папки, которые становятся пустыми после выполнения этой операции.
zh_hans: 删除在此操作后变为空的所有文件夹。
zh_hant: 刪除在這項作業之後變為空白的所有資料夾。

# DefaultDestinationOptionDesc
source: The path, relative to the current directory, where library files should be installed if no destination is defined for a given library.
cs: Cesta, která je relativní k aktuálnímu adresáři a do které mají být nainstalovány soubory knihoven, pokud pro danou knihovnu není definován žádný cíl
de: Der Pfad (relativ zum aktuellen Verzeichnis), in dem Bibliotheksdateien installiert werden sollen, wenn für eine Bibliothek kein Ziel definiert ist.
pt_br: O caminho, relativo ao diretório atual, onde os arquivos de biblioteca devem ser instalados se nenhum destino foi definido para uma determinada biblioteca.
ru: Путь относительно текущего каталога, по которому должны быть установлены библиотеки, если для заданной библиотеки не указано место назначения.
zh_hans: 相对于当前目录的路径, 如果没有为给定的库定义目标, 则应在其中安装库文件。
zh_hant: 相對於目前目錄的路徑，如果未為指定的程式庫定義目的地，就會在其中安裝程式庫檔案。

# DefaultProviderOptionDesc
source: The provider to use if no provider is defined for a given library. (eg. “cdnjs”, “filesystem”)
cs: Poskytovatel, který se má použít, pokud pro danou knihovnu není definován žádný poskytovatel (např. cdnjs, filesystem)
de: Der zu verwendende Anbieter, wenn für eine Bibliothek kein Anbieter definiert wurde (z. B. "cdnjs", "filesystem")
pt_br: O provedor a ser usado se nenhum provedor for definido para uma determinada biblioteca. (por exemplo. "cdnjs", "sistema de arquivos")
ru: Поставщик, который будет использоваться, если поставщик для заданной библиотеки не установлен (например, "cdnjs", "filesystem")
zh_hans: 未为给定库定义提供程序时要使用的提供程序。(例如 “cdnjs”、“filesystem”)
zh_hant: 在未為指定的程式庫定義任何提供者時，要使用的提供者 (例如 “cdnjs”、“filesystem”)

# DestinationOptionDesc
source: Location to install the library (if not specified, the default destination location will be used)
cs: Umístění pro instalaci knihovny (Pokud není zadané, použije se výchozí cílové umístění.)
de: Speicherort zum Installieren der Bibliothek (sofern nicht angegeben, wird der Standardspeicherort verwendet)
pt_br: O local para instalar a biblioteca (se não especificado, o local de destino padrão será usado)
ru: Расположение для установки библиотеки (если не указано, будет использоваться расположение по умолчанию)
zh_hans: 安装库的位置 (如果未指定, 将使用默认目标位置)
zh_hant: 要安裝程式庫的位置 (若未指定，會使用預設目的地位置)

# ExamplesHeader
source: Examples:
cs: Příklady:
de: Beispiele:
pt_br: Exemplos:
ru: Примеры:
zh_hans: 示例:
zh_hant: 範例:

# FilesOptionDesc
source: The files from the specified library to install (if not specified, all files from the library will be installed)
cs: Soubory ze zadané knihovny k instalaci (Pokud nejsou zadané, nainstalují se všechny soubory z knihovny.)
de: Die Dateien aus der angegebenen Bibliothek, die installiert werden sollen (sofern nicht angegeben, werden alle Dateien aus der Bibliothek installiert)
pt_br: Os arquivos da biblioteca especificada a serem instalados (se não especificado, todos os arquivos da bibliotecas serão instalados)
ru: Файлы из указанной библиотеки, которые будут установлены (если этот параметр не указан, будут установлены все файлы из библиотеки)
zh_hans: 要安装的指定库中的文件 (如果未指定, 则将安装库中的所有文件)
zh_hant: 指定的程式庫中要安裝的檔案 (若未指定，會安裝程式庫的所有檔案)

# InitCommandDesc
source: Create a new libman.json
cs: Vytvoří nový soubor libman.json.
de: Neue Datei "libman.json" erstellen
pt_br: Criar um novo libman.json
ru: Создать новый файл libman.json
zh_hans: 创建新的 libman. json
zh_hant: 建立新的 libman.json

# InstallCommandDesc
source: Add a library definition to the libman.json file, and download the library to the specified location
cs: Přidá definici knihovny do souboru LibMan.json a stáhne knihovnu do zadaného umístění.
de: Fügen Sie der Datei "libman.json" eine Bibliotheksdefinition hinzu, und laden Sie die Bibliothek an den angegebenen Speicherort herunter.
pt_br: Adiciona uma definição de biblioteca ao arquivo LibMan.json e baixa a biblioteca para o local especificado
ru: Добавьте определение библиотеки в файл LibMan.json и загрузите библиотеку в указанное расположение
zh_hans: 向 LibMan.json 文件添加库定义, 并将库下载到指定位置
zh_hant: 將程式庫定義新增到 LibMan.json 檔案，並將程式庫下載到指定的位置

# InstallCommandLibraryIdArgumentDesc
source: Library to install
cs: Knihovna k instalaci
de: Bibliothek, die installiert werden soll
pt_br: Biblioteca a ser instalada
ru: Библиотека, которая будет установлена
zh_hans: 要安装的库
zh_hant: 要安裝的程式庫

# InstallCommandProviderSpecificLogic
source: CDNJS libraries have a library ID format of “<libraryName>@<libraryVersion>” For CDNJS libraries, if no version is specified in the library ID, the highest version available is used.
cs: Knihovny CDNJS mají formát ID knihovny <názevKnihovny>@<verzeKnihovny>. Pokud se u knihoven CDNJS nezadá v ID knihovny žádná verze, použije se nejvyšší dostupná verze.
de: CDNJS-Bibliotheken weisen folgendes Format für die Bibliotheks-ID auf: "<Bibliotheksname>@<Bibliotheksversion>" Wenn für CDNJS-Bibliotheken keine Version in der Bibliotheks-ID angegeben ist, wird die höchste verfügbare Version verwendet.
pt_br: As bibliotecas de CDNJS têm um formato de ID de "< Nomedabiblioteca>@<Versãodbiblioteca>" Para bibliotecas CDNJS, se nenhuma versão for especificada no ID da biblioteca, a versão mais recente disponível será usada.
ru: Для библиотек CDNJS используется следующий формат идентификатора библиотеки: "<имя библиотеки>@<версия библиотеки>" Если в идентификаторе библиотеки CDNJS не указана версия, используется максимальная доступная версия.
zh_hans: CDNJS 库的库 ID 格式为“<库名称>@<库版本>” 对于 CDNJS 库，如果库 ID 中没有指定版本，则使用最高可用版本。
zh_hant: CDNJS 程式庫的程式庫識別碼格式為 “<libraryName>@<libraryVersion>” 對於 CDNJS 程式庫，若未在程式庫識別碼中指定任何版本，就會使用可用的最高版本。

# InstallCommandRemarks
source: Initializes a libman.json if one does not exist If no default provider exists, --provider option is required If no default destination exists, --destination option is required If no files are specified, the entire library is included
cs: Inicializuje libman.json, pokud neexistuje. Pokud neexistuje žádný výchozí poskytovatel, vyžaduje se možnost --provider. Pokud neexistuje žádný výchozí cíl, vyžaduje se možnost --destination. Pokud nejsou určeny žádné soubory, zahrne se celá knihovna.
de: Hiermit wird eine Datei "libman.json" initialisiert, wenn keine vorhanden ist. Wenn kein Standardanbieter vorhanden ist, muss die Option "--provider" angegeben werden. Wenn kein Standardziel vorhanden ist, muss die Option "--destination" angegeben werden. Wenn keine Dateien angegeben werden, wird die gesamte Bibliothek eingeschlossen.
pt_br: Inicializa o libman.json se ainda não existir um. Se não houver um provedor padrão, a opção --provider será exigida Se não houver um destino padrão, a opção --destination será exigida Se nenhum arquivo for especificado, a biblioteca inteira será incluída
ru: Инициализирует файл libman.json, если его не существует Если поставщик по умолчанию не задан, параметр --provider является обязательным Если место назначения по умолчанию не задано, параметр --destination является обязательным Если файлы не указаны, будет включена вся библиотека
zh_hans: 如果不存在 libman.json 则初始化它 如果不存在默认提供程序，则需要 --provider 选项，如果不存在默认目标，则需要 --destination 选项 如果未指定文件，则包括整个库
zh_hant: 如果沒有 libman.json，就加以初始化 如果沒有預設提供者，就需要 --provider 選項 如果沒有預設目的地，就需要 --destination 選項 如果未指定檔案，會包含整個程式庫

# InvalidArgumentsMessage
source: Invalid arguments for command: {0}
cs: Neplatné argumenty pro příkaz: {0}
de: Ungültige Argumente für Befehl: {0}
pt_br: Argumentos inválidos para o comando: {0}
ru: Недопустимые аргументы для команды: {0}
zh_hans: 命令的参数无效: {0}
zh_hant: 命令的引數無效: {0}

# LibmanCommandDesc
source: Library Manager
cs: Správce knihoven
de: Bibliotheks-Manager
pt_br: Gerenciador de Bibliotecas
ru: Диспетчер библиотек
zh_hans: 库管理器
zh_hant: 程式庫管理員

# ProviderOptionDesc
source: Provider to use (if not specified, the default provider will be used)
cs: Poskytovatel, který se má použít (Pokud není zadán, použije se výchozí poskytovatel.)
de: Der zu verwendende Anbieter (sofern nicht angegeben, wird der Standardanbieter verwendet)
pt_br: Provedor a ser usado (se não especificado, o provedor padrão será usado)
ru: Используемый поставщик (если не указан, будет использован поставщик по умолчанию)
zh_hans: 要使用的提供程序 (如果未指定, 将使用默认提供程序)
zh_hant: 要使用的提供者 (若未指定，會使用預設提供者)

# ProviderSpecificLogicHeader
source: Provider-specific logic:
cs: Logika specifická pro poskytovatele:
de: Anbieterspezifische Logik:
pt_br: Lógica específica do provedor:
ru: Логика для определенного поставщика:
zh_hans: 特定于提供程序的逻辑:
zh_hant: 提供者專屬的邏輯:

# RemarksHeader
source: Remarks:
cs: Poznámky:
de: Hinweise:
pt_br: Comentários:
ru: Примечания:
zh_hans: 言论:
zh_hant: 備註:

# RestoreCommandDesc
source: Downloads all files from provider and saves them to specified destination
cs: Stáhne všechny soubory od poskytovatele a uloží je do zadaného cíle.
de: Hiermit werden alle Dateien aus dem Anbieter heruntergeladen und am angegebenen Ziel gespeichert.
pt_br: Baixa todos os arquivos do provedor e os salva no destino especificado
ru: Скачивает все файлы от поставщика и сохраняет их в указанный каталог
zh_hans: 从提供程序下载所有文件并将其保存到指定的目标
zh_hant: 從提供者下載所有檔案，並將其儲存到指定的目的地

# RestoreCommandRemarks
source: Error if no libman.json in current folder If a library specifies a provider, it will override the defaultProvider If a library specifies a destination, it will override the defaultDestination
cs: Chyba, pokud libman.json není v aktuální složce Pokud knihovna určuje poskytovatele, přepíše položku defaultProvider. Pokud knihovna určuje cíl, přepíše položku defaultDestination.
de: Fehler, wenn keine Datei "libman.json" im aktuellen Ordner vorliegt. Wenn eine Bibliothek einen Anbieter angibt, überschreibt dieser den defaultProvider-Wert. Wenn eine Bibliothek ein Ziel angibt, überschreibt dieses den defaultDestination-Wert.
pt_br: Erro se não houver libman.json na pasta atual Se uma biblioteca especificar um provedor, ele sobrescreverá o defaultProvider Se uma biblioteca especificar um destino, ele sobrescreverá o defaultDestination
ru: Ошибка при отсутствии файла libman.json в текущей папке Если для библиотеки указан поставщик, он переопределит defaultProvider Если для библиотеки указано место назначения, оно переопределит defaultDestination
zh_hans: 如果当前文件夹中不存在 libman.json 则出错 如果库指定提供程序，它将覆盖 defaultProvider 如果库指定目标，它将覆盖 defaultDestination
zh_hant: 若目前的資料夾中沒有 libman.json，會發生錯誤 若程式庫指定了提供者，就會覆寫 defaultProvider 若程式庫指定了目的地，就會覆寫 defaultDestination

# UnInstallCommandDesc
source: Deletes all files for the specified library from their specified destination, then removes the specified library definition from libman.json
cs: Odstraní všechny soubory zadané knihovny ze zadaného cíle a pak odebere definici zadané knihovny ze souboru libman.json.
de: Löscht alle Dateien für die angegebene Bibliothek aus den angegeben Zielen und entfernt anschließend die angegebene Bibliotheksdefinition aus "libman.json".
pt_br: Exclui do destino especificado todos os arquivos da biblioteca especificada e, em seguida, remove do libman.json a definição de biblioteca especificada
ru: Удаляет все файлы для указанной библиотеки из указанного места назначения, а затем удаляет определение указанной библиотеки из файла libman.json
zh_hans: 从指定的目标删除指定库的所有文件, 然后从 libman.json 删除指定的库定义
zh_hant: 從指定的目的地刪除指定程式庫的所有檔案，然後從 libman.json 移除指定的程式庫定義

# UninstallCommandLibraryIdArgumentDesc
source: Library to uninstall
cs: Knihovna k odinstalaci
de: Bibliothek, die installiert werden soll
pt_br: Biblioteca a ser desinstalada
ru: Библиотека, которая будет удалена
zh_hans: 要卸载的库
zh_hant: 要解除安裝的程式庫

# UninstallCommandProviderOptionDesc
source: The provider of the library to be uninstalled
cs: Poskytovatel knihovny k odinstalaci
de: Der Anbieter der Bibliothek, die deinstalliert werden soll
pt_br: O provedor da biblioteca a ser desinstalada
ru: Поставщик библиотеки, который будет удален
zh_hans: 要卸载的库的提供程序
zh_hant: 要解除安裝的程式庫提供者

# UnInstallCommandProviderSpecificLogic
source: CDNJS libraries have a library ID format of “<libraryName>@<libraryVersion>” If no version is specified in the library ID, this command will act on any library with libraryName matching the given libraryId
cs: Knihovny CDNJS mají formát ID knihovny <názevKnihovny>@<verzeKnihovny>. Pokud se u knihoven CDNJS nezadá v ID knihovny žádná verze, tento příkaz se provede pro všechny knihovny, jejichž názevKnihovny bude odpovídat danému ID knihovny.
de: CDNJS-Bibliotheken weisen folgendes Format für die Bibliotheks-ID auf: "<Bibliotheksname>@<Bibliotheksversion>" Wenn keine Version in der Bibliotheks-ID angegeben ist, wird dieser Befehl für alle Bibliotheken ausgeführt, deren Bibliotheksname der angegebenen Bibliotheks-ID entspricht.
pt_br: Libraries de CDNJS têm um formato de ID de "<Nomedabiblioteca>@<Versãodabiblioteca>" Se nenhuma versão for especificada no ID da biblioteca, este comando irá agir em qualquer biblioteca com libraryName correspondentes a determinado libraryId
ru: Для библиотек CDNJS используется следующий формат идентификатора библиотеки: "<имя библиотеки>@<версия библиотеки>" Если в идентификаторе библиотеки не указана версия, эта команда будет применена ко всем библиотекам, название которых соответствует указанному идентификатору библиотеки
zh_hans: CDNJS 库的库 ID 格式为“<库名称>@<库版本>” 如果库 ID 中没有指定版本，此命令将作用于库名称与给定库 ID 匹配的任何库
zh_hant: CDNJS 程式庫的程式庫識別碼格式為 “<libraryName>@<libraryVersion>” 若未在程式庫識別碼中指定任何版本，就會對 libraryName 符合指定 libraryId 的任何程式庫執行這項命令

# UnInstallCommandRemarks
source: Error if no libman.json in current folder Error if specified library doesn't exist If there's more than one library with the same libraryId, you'll be prompted to choose.
cs: Chyba, pokud libman.json není v aktuální složce Chyba, pokud zadaná knihovna neexistuje Pokud existuje více než jedna knihovna se stejným libraryId, zobrazí se výzva k jejímu výběru.
de: Fehler, wenn keine Datei "libman.json" im aktuellen Ordner vorliegt. Fehler, wenn die angegebene Bibliothek nicht vorhanden ist. Falls mehr als eine Bibliothek mit derselben libraryId gefunden wird, werden Sie zur Auswahl aufgefordert.
pt_br: Erro se não houver libman.json na pasta atual Erro se a biblioteca especificada não existir Se houver mais de uma biblioteca com o mesmo libraryId, você será solicitado a escolher uma.
ru: Ошибка, если файл libman.json отсутствует в текущей папке Ошибка, если указанная библиотека не существует При наличии нескольких библиотек с одним и тем же идентификатором вам будет предложено выбрать библиотеку.
zh_hans: 若当前文件夹中不存在 libman.json 则出错 若指定的库不存在则出错 若有多个具有相同 libraryId 的库，则提示你进行选择。
zh_hant: 若目前的資料夾沒有 libman.json，會發生錯誤 若指定的程式庫不存在，會發生錯誤 若有多個 libraryId 相同的程式庫，系統會提示您選擇。

# VerbosityOptionDesc
source: Set the verbosity of output (eg. "normal", "detailed", "quiet")
cs: Nastavte podrobnost výstupu (např. normální, podrobný, nerušit).
de: Ausführlichkeit der Ausgabe festlegen (z. B. "normal", "detailed", "quiet")
pt_br: Definir os detalhes de saída (ex.: "normal", "detalhada", "silenciosa")
ru: Установить уровень детализации выходных данных (доступные значения: "normal", "detailed", "quiet")
zh_hans: 设置输出的详细程度(例如“正常”、“详细”、“安静”)
zh_hant: 設定輸出的詳細資訊層級 (例如「正常」、「詳細」、「安靜」)

# ProjectPathOptionDesc
source: Path to the project (Current directory is used as default)
cs: Cesta k projektu (aktuální adresář nastaven jako výchozí)
de: Pfad zum Projekt (standardmäßig wird das aktuelle Verzeichnis verwendet)
pt_br: Caminho para o projeto (o diretório atual é usado como padrão)
ru: Путь к проекту (по умолчанию используется текущий каталог)
zh_hans: 项目的路径(默认使用当前目录)
zh_hant: 專案的路徑 (預設會使用目前目錄)

# DirectoryNotFoundMessage
source: Directory not found {0}
cs: Adresář {0} nebyl nalezen.
de: Verzeichnis nicht gefunden: "{0}"
pt_br: Diretório não encontrado {0}
ru: Каталог не найден {0}
zh_hans: 找不到目录 {0}
zh_hant: 找不到目錄 {0}

# FailedToRestoreLibraryMessage
source: Failed to restore "{0}"
cs: Nepodařilo se obnovit {0}.
de: Fehler beim Wiederherstellen von "{0}".
pt_br: Falha ao restaurar "{0}"
ru: Не удалось восстановить "{0}"
zh_hans: 未能还原 "{0}"
zh_hant: 無法還原 "{0}"

# FileDeleted
source: {0} deleted
cs: Soubor {0} byl smazán.
de: "{0}" wurde gelöscht.
pt_br: {0} excluído
ru: Файл {0} удален
zh_hans: 已删除 {0}
zh_hant: {0} 已刪除

# FileDeleteFail
source: Failed to delete {0}
cs: Soubor {0} nebylo možné smazat.
de: Fehler beim Löschen von "{0}".
pt_br: Falha ao excluir {0}
ru: Не удалось удалить {0}
zh_hans: 未能删除 {0}
zh_hant: 無法刪除 {0}

# FileWrittenToDisk
source: {0} written to disk
cs: Soubor {0} byl uložen na disk.
de: "{0}" wurde auf die Festplatte geschrieben.
pt_br: {0} gravado em disco
ru: {0} записан на диск
zh_hans: {0} 写入磁盘
zh_hant: {0} 已寫入磁碟

# InitFailedLibmanJsonFileExists
source: Failed to init: A 'libman.json' already exists
cs: Nešlo inicializovat: libman.json už existuje.
de: Fehler bei der Initialisierung: Es ist bereits eine Datei "libman.json" vorhanden.
pt_br: Falha ao inic.: já existe um 'libman.json'
ru: Не удалось выполнить инициализацию: файл "libman.json" уже существует
zh_hans: 初始化失败: "libman.json" 已存在
zh_hant: 無法初始化: 'libman.json' 已存在

# CleanFailed
source: Failed to clean some files.
cs: Nepodařilo se vyčistit některé soubory.
de: Fehler beim Bereinigen einiger Dateien.
pt_br: Falha ao limpar alguns arquivos.
ru: Не удалось очистить некоторые файлы.
zh_hans: 无法清理某些文件。
zh_hant: 無法清除某些檔案。

# LibmanJsonNotFound
source: libman.json was not found:{0}
cs: Soubor libman.json nebyl nalezen: {0}
de: Die Datei "libman.json" wurde nicht gefunden: {0}
pt_br: libman.json não encontrado:{0}
ru: Файл libman.json не найден: {0}
zh_hans: 未找到 libman.json:{0}
zh_hant: 找不到 libman.json: {0}

# DestinationRequiredWhenNoDefaultIsPresent
source: Default destination is not set. Please provide a destination using '--destination'
cs: Není nastaven výchozí cíl. Zadejte ho prosím pomocí argumentu --destination.
de: Das Standardziel ist nicht festgelegt. Geben Sie mithilfe von "--destination" ein Ziel an.
pt_br: O destino padrão não foi definido. Forneça um destino usando '--destination'
ru: Место назначения по умолчанию не задано. Укажите его с помощью параметра '--destination'
zh_hans: 未设置默认目标。请使用 "--destination" 提供目标
zh_hant: 未設定預設目的地。請使用 '--destination' 提供目的地

# LibraryIdRequiredForInstall
source: LibraryId is required to install
cs: Pro instalaci je nutná položka LibraryId.
de: LibraryId für Installation erforderlich
pt_br: É necessário o LibraryId para instalar
ru: Для установки требуется идентификатор библиотеки
zh_hans: 需要 LibraryId 才能安装
zh_hant: 必須安裝 LibraryId

# LibraryIdRequiredForUnInstall
source: LibraryId is required to uninstall
cs: Při odinstalaci se vyžaduje LibraryId.
de: Die LibraryId muss deinstalliert werden.
pt_br: É necessário o LibraryId para instalar
ru: Для удаления необходимо указать идентификатор библиотеки
zh_hans: 需要 LibraryId 才能卸载
zh_hant: 必須將 LibraryId 解除安裝

# MoreThanOneLibraryFoundToUninstall
source: More than one library found with id "{0}"
cs: Nalezena více než jedna knihovna s ID {0}
de: Mehr als eine Bibliothek mit der ID "{0}" gefunden.
pt_br: Mais de uma biblioteca encontrada com a id "{0}"
ru: Обнаружено несколько библиотек с идентификатором "{0}"
zh_hans: 发现多个 ID 为“{0}”的库
zh_hant: 找到多個識別碼為 "{0}" 的程式庫

# ProviderRequiredWhenNoDefaultIsPresent
source: Default Provider is not set. Please provide a provider using '--provider'
cs: Výchozí poskytovatel není nastaven. Uveďte prosím poskytovatele pomocí argumentu --provider.
de: Der Standardanbieter ist nicht festgelegt. Geben Sie mit "--provider" einen Anbieter an.
pt_br: O Provedor padrão não foi definido. Forneça um provedor usando '--provider'
ru: Поставщик по умолчанию не задан. Укажите поставщика с помощью параметра '--provider'
zh_hans: 未设置默认提供程序。请用 "--provider" 提供提供程序
zh_hant: 未設定預設提供者。請使用 '--provider' 提供提供者

# UseProviderToDisambiguateMessage
source: Use --provider to disambiguate libraries of same name from different providers in the project
cs: Argument --provider slouží k odlišení knihoven se stejným názvem, ale od různých poskytovatelů v projektu.
de: Verwenden Sie "--provider", um gleichnamige Bibliotheken unterschiedlicher Anbieter im Projekt eindeutig zu kennzeichnen.
pt_br: Use --provider para desfazer a ambiguidade entre bibliotecas com o mesmo nome de provedores diferentes no projeto
ru: Используйте параметр --provider, чтобы различить библиотеки с одинаковыми именами от различных поставщиков в проекте
zh_hans: 使用 --provider 消除项目中来自不同提供程序的同名库的歧义
zh_hant: 使用 --provider 來區分專案中不同提供者之間的同名程式庫

# MoreThanOneLibraryFoundToUninstallForProvider
source: More than one library found with id "{0}" for provider "{1}". Please remove the manually from the libman.json file
cs: Byla nalezena více než jedna knihovna s ID {0} pro poskytovatele {1}. Odeberte je prosím ručně ze souboru libman.json.
de: Für den Anbieter "{1}" wurde mehr als eine Bibliothek mit der ID "{0}" gefunden. Entfernen Sie die Bibliothek manuell aus der Datei "libman.json".
pt_br: Mais de uma biblioteca encontrada com a id "{0}" para o provedor "{1}". Remova manualmente do arquivo libman.json
ru: Для поставщика "{1}" обнаружено несколько библиотек с идентификатором "{0}". Удалите эти библиотеки из файла libman.json вручную
zh_hans: 为提供程序 "{1}" 找到 id 为 "{0}" 的多个库。请从 libman.json 文件中手动删除
zh_hant: 找到提供者 "{1}" 有多個識別碼為 "{0}" 的程式庫。請從 libman.json 檔案手動予以移除

# NoLibraryToUninstall
source: Library "{0}" is not installed. Nothing to uninstall
cs: Knihovna {0} není nainstalovaná. Není k dispozici nic k odinstalaci.
de: Die Bibliothek "{0}" ist nicht installiert. Keine Elemente zur Installation vorhanden.
pt_br: A biblioteca "{0}" não está instalada. Não há nada para desinstalar.
ru: Библиотека "{0}" не установлена. Удаляемые библиотеки отсутствуют
zh_hans: 未安装库 "{0}"。没有可卸载的内容
zh_hant: 程式庫 "{0}" 未安裝。未將任何項目解除安裝

# CacheCleanCommandDesc
source: Delete all files from the local machine's LibMan cache.
cs: Odstraní všechny soubory z mezipaměti LibMan místního počítače.
de: Hiermit werden alle Dateien aus dem LibMan-Cache des lokalen Computers gelöscht.
pt_br: Exclui todos os arquivos do cache LibMan do computador local.
ru: Удалить все файлы из кэша на локальном компьютере LibMan.
zh_hans: 从本地计算机的 LibMan 缓存中删除所有文件。
zh_hant: 從本機電腦的 LibMan 快取中刪除所有檔案。
