Repository: aspnet/LibraryManager.Loc
Catalog: src/libman/MultilingualResources/libman.*.xlf
Languages: cs, de, pt_br, ru, zh_hans, zh_hant

# CacheListCommandDesc
source: Display a list of all libraries that are stored in the local machine’s LibMan cache.
cs: Zobrazí seznam všech knihoven, které jsou uložené v mezipaměti LibMan místního počítače.
de: Hiermit wird eine Liste aller Bibliotheken angezeigt, die im LibMan-Cache des lokalen Computers gespeichert sind.
pt_br: Exibe uma lista com todas as bibliotecas armazenadas no cache LibMan do computador local.
ru: Отображает список всех библиотек, которые хранятся в кэше локального компьютера LibMan.
zh_hans: 显示存储在本地计算机的 LibMan 缓存中的所有库的列表。
zh_hant: 顯示所有儲存於本機電腦 LibMan 快取中的程式庫清單。

# CacheCleanProviderArgumentDesc
source: Provider for which the cache files should be cleaned.
cs: Poskytovatel, pro kterého mají být soubory mezipaměti vyčištěny
de: Anbieter, für den die Cachedateien bereinigt werden sollen.
pt_br: Provedor para o qual os arquivos de cache devem ser limpos.
ru: Поставщик, для которого необходимо очистить файлы кэша.
zh_hans: 要为其清除缓存文件的提供程序。
zh_hant: 要為其清除快取檔案的提供者。

# UpdateCommandDesc
source: Updates the specified library
cs: Aktualizuje zadanou knihovnu.
de: Hiermit wird die angegebene Bibliothek aktualisiert.
pt_br: Atualiza a biblioteca especificada
ru: Обновляет указанную библиотеку
zh_hans: 更新指定的库
zh_hant: 更新指定的程式庫

# UpdateCommandRemarks
source: Error if no libman.json in current folder Error if specified library doesn't exist If there's more than one library with the same libraryId, you'll be prompted to choose.
cs: Chyba, pokud libman.json není v aktuální složce Chyba, pokud zadaná knihovna neexistuje Pokud existuje více než jedna knihovna se stejným libraryId, zobrazí se výzva k jejímu výběru.
de: Fehler, wenn keine Datei "libman.json" im aktuellen Ordner vorliegt. Fehler, wenn die angegebene Bibliothek nicht vorhanden ist. Falls mehr als eine Bibliothek mit derselben libraryId vorhanden ist, werden Sie zur Auswahl aufgefordert.
pt_br: Erro se nenhum libman.json for encontrado na pasta local Erro se a biblioteca especificada não existir Se houver mais de uma biblioteca com o mesmo libraryId, será necessário escolher.
ru: Ошибка при отсутствии файла libman.json в текущей папке Ошибка, если указанная библиотека не существует При наличии нескольких библиотек с одинаковыми идентификаторами вам будет предложено выбрать библиотеку.
zh_hans: 若当前文件夹中不存在 libman.json 则出错 若指定的库不存在则出错 若有多个具有相同 libraryId 的库，则提示你进行选择。
zh_hant: 若目前的資料庫沒有 libman.json，會發生錯誤 若指定的程式庫不存在，會發生錯誤 若有多個 libraryId 相同的程式庫，系統會提示您選擇。

# UpdateCommandLibraryArgumentDesc
source: Name of the library to update (without the version).
cs: Název knihovny k aktualizaci (bez verze)
de: Name der Bibliothek, die aktualisiert werden soll (ohne Version).
pt_br: Nome da biblioteca a ser atualizada (sem a versão).
ru: Имя обновляемой библиотеки (без номера версии).
zh_hans: 要更新的库的名称 (不带版本)。
zh_hant: 要更新的程式庫名稱 (不含版本)。

# UpdateCommandPreReleaseOptionDesc
source: If specified, the latest pre-release version of the library will be downloaded (where applicable)
cs: Pokud je zadaná tato možnost, stáhne se nejnovější předběžná verze knihovny (v případě potřeby)
de: Sofern angegeben, wird die neueste Vorabversion der Bibliothek heruntergeladen (wo zutreffend)
pt_br: Se especificado, a versão de pré-lançamento mais recente da biblioteca é baixada (se aplicável)
ru: Если этот параметр указан, будет загружена последняя предварительная версия библиотеки (если применимо)
zh_hans: 如果指定, 将下载最新的库预发行版本 (如果适用)
zh_hant: 如有指定，就會下載程式庫的最新發行版本 (如果適用)

# UpdateCommandProviderOptionDesc
source: If specified, only libraries from the specified provider will be updated
cs: Pokud je zadaná tato možnost, aktualizují se jen knihovny od zadaného poskytovatele.
de: Sofern angegeben, werden nur Bibliotheken des angegebenen Anbieters aktualisiert.
pt_br: Se especificado, apenas bibliotecas do provedor especificado serão atualizadas
ru: Если этот параметр указан, будут обновлены только библиотеки от указанного поставщика
zh_hans: 如果指定, 则仅更新来自指定提供程序的库
zh_hant: 如有指定，就只會更新來自指定提供者的程式庫

# CacheCleanedMessage
source: Cache cleaned.
cs: Mezipaměť byla vyčištěna.
de: Cache bereinigt.
pt_br: Cache limpo.
ru: Очистка кэша выполнена.
zh_hans: 已清理缓存。
zh_hant: 快取已清除。

# CacheCleanFailed
source: Failed to clean cache: {0}
cs: Nepodařilo se vyčistit mezipaměť: {0}
de: Fehler beim Bereinigen des Caches: {0}
pt_br: Falha ao limpar cache: {0}
ru: Не удалось очистить кэш: {0}
zh_hans: 无法清除缓存: {0}
zh_hant: 無法清除快取: {0}

# CacheContentMessage
source: Cache contents:
cs: Obsah mezipaměti:
de: Inhalte des Caches:
pt_br: Conteúdo do cache:
ru: Содержимое кэша:
zh_hans: 缓存内容:
zh_hant: 快取內容:

# CacheEmptyMessage
source: (empty)
cs: (prázdné)
de: (leer)
pt_br: (vazio)
ru: (пусто)
zh_hans: (空)
zh_hant: (空白)

# CacheForProviderCleanedMessage
source: {0} cache cleaned.
cs: Mezipaměť {0} byla vyčištěna.
de: {0} Cache bereinigt.
pt_br: cache {0} limpo.
ru: Очистка кэша {0} выполнена.
zh_hans: 已清除 {0} 缓存。
zh_hant: 已清除 {0} 快取。

# CacheListFilesOptionDesc
source: List files that are cached for each library
cs: Vytvoří pro každou knihovnu seznam souborů, které jsou uložené v mezipaměti.
de: Für jede Bibliothek zwischengespeicherte Dateien auflisten
pt_br: Lista os arquivos armazenados em cache de cada biblioteca
ru: Список кэшируемых файлов для каждой библиотеки
zh_hans: 列出为每个库缓存的文件
zh_hant: 列出為各個程式庫快取的檔案

# MoreThanOneLibraryFoundToUpdate
source: More than one library found with name "{0}"
cs: Byla nalezena více než jedna knihovna s názvem {0}.
de: Es wurde mehr als eine Bibliothek mit dem Namen "{0}" gefunden.
pt_br: Mais de uma biblioteca encontrada com o nome "{0}"
ru: Обнаружено несколько библиотек с именем "{0}"
zh_hans: 发现多个名为 "{0}" 的库
zh_hant: 找到多個名稱為 "{0}" 的程式庫

# NoLibrariesToUpdate
source: No libraries to update. Please use install command to install libraries
cs: Žádné knihovny k aktualizaci. Nainstalujte je prosím pomocí příkazu install.
de: Keine Bibliotheken zur Aktualisierung vorhanden. Verwenden Sie den install-Befehl zum Installieren von Bibliotheken.
pt_br: Não há bibliotecas para atualizar. Use o comando install para instalar bibliotecas
ru: Библиотеки для обновления отсутствуют. Используйте команду install для установки библиотек
zh_hans: 没有要更新的库。请使用安装命令安装库
zh_hant: 沒有任何可更新的程式庫。請使用 install 命令安裝程式庫

# NoLibraryFoundToUpdate
source: No library found with name "{0}" to update. Please specify a library name without the version information to update.
cs: Nenašla se žádná knihovna s názvem {0}, která by se měla aktualizovat. Zadejte prosím název knihovny k aktualizaci bez údaje o verzi.
de: Es wurde keine Bibliothek mit dem Namen "{0}" für die Aktualisierung gefunden. Geben Sie einen Bibliotheksnamen ohne Versionsinformationen für die Aktualisierung an.
pt_br: Nenhuma biblioteca encontrada com nome "{0}" para atualizar. Especifique um nome de biblioteca sem as informações de versão para atualizar.
ru: Отсутствует обновляемая библиотека с именем "{0}". Укажите имя библиотеки без версии.
zh_hans: 找不到名为 "{0}" 库以进行更新。 请指定不含版本信息的库名以进行更新。
zh_hant: 找不到任何名稱為 "{0}" 的程式庫可更新。 請指定沒有版本資訊的程式庫名稱以更新。

# InstallLibraryFailed
source: Failed to install library "{0}"
cs: Nepodařilo se nainstalovat knihovnu {0}.
de: Fehler beim Installieren der Bibliothek "{0}".
pt_br: Falha ao instalar a biblioteca "{0}"
ru: Не удается установить библиотеку "{0}"
zh_hans: 安装库 "{0}" 失败
zh_hant: 無法安裝程式庫 "{0}"

# CacheListLibrariesOptionDesc
source: Lists the libraries cached for each provider.
cs: Vytvoří pro každého poskytovatele seznam knihoven, které jsou uložené v mezipaměti.
de: Hiermit werden die für jeden Anbieter zwischengespeicherten Bibliotheken aufgelistet.
pt_br: Lista as bibliotecas armazenadas em cache para cada provedor.
ru: Список библиотек, которые кэшируются для каждого поставщика.
zh_hans: 列出为每个提供程序缓存的库。
zh_hant: 列出為各個提供者快取的程式庫。

# ProviderNotInstalled
source: Provider "{0}" is not installed
cs: Poskytovatel {0} není nainstalovaný.
de: Der Anbieter "{0}" ist nicht installiert.
pt_br: O provedor "{0}" não está instalado
ru: Поставщик "{0}" не установлен
zh_hans: 未安装提供程序 "{0}"
zh_hant: 未安裝提供者 "{0}"

# SuggestedIdsMessage
source: Similar libraries:
cs: Podobné knihovny:
de: Ähnliche Bibliotheken:
pt_br: Bibliotecas similares:
ru: Похожие библиотеки:
zh_hans: 类似的库:
zh_hant: 相似的程式庫:

# FixManifestFile
source: Please fix the libman.json file and try again
cs: Opravte prosím soubor libman.json a zkuste to znovu.
de: Korrigieren Sie die Datei "libman.json", und wiederholen Sie den Vorgang.
pt_br: Corrija o arquivo libman.json e tente novamente
ru: Исправьте файл libman.json и повторите попытку.
zh_hans: 请修复 libman.json 文件, 然后重试
zh_hant: 請修正 libman.json 檔案，然後再試一次

# ChooseAnOption
source: Select an option:
cs: Vyberte možnost:
de: Wählen Sie eine Option aus:
pt_br: Selecione uma opção:
ru: Выберите вариант:
zh_hans: 选择一个选项:
zh_hant: 請選取選項:

# LatestVersionAlreadyInstalled
source: The library "{0}" is already up to date
cs: Knihovna {0} už je aktualizovaná.
de: Die Bibliothek "{0}" ist bereits auf dem neuesten Stand.
pt_br: A biblioteca "{0}" já está atualizada
ru: Библиотека "{0}" уже обновлена
zh_hans: 库 "{0}" 已是最新版本
zh_hant: 程式庫 "{0}" 已在最新狀態

# InvalidToVersion
source: "{0}" is not a valid value for --to-version
cs: {0} není platná hodnota pro --to-version.
de: "{0}" ist kein gültiger Wert für "--to-version".
pt_br: "{0}" não e um valor válido para --to-version
ru: Значение "{0}" не может использоваться с параметром --to-version
zh_hans: "{0}" 不是 --to-version 的有效值
zh_hant: "{0}" 對 --to-version 而言不是有效的值

# UpdateCommandToVersionOptionDesc
source: The version to update the library to (needs complete libraryid for the provider)
cs: Verze, na kterou se má knihovna aktualizovat (nutné zadat úplnou položku libraryid pro poskytovatele)
de: Die Version, auf die die Bibliothek aktualisiert werden soll (erfordert die vollständige libraryid für den Anbieter)
pt_br: A versão para qual a biblioteca será atualizada (é necessário o libraryid completo para o provedor)
ru: Версия, до которой необходимо обновить библиотеку (необходимо указать идентификатор библиотеки поставщика)
zh_hans: 要将库更新到的版本 (需要提供程序的完整 libraryid)
zh_hant: 程式庫要更新的目標版本 (需要提供者的完整 libraryid)

# InstalledLibrary
source: Installed library "{0}" to "{1}"
cs: Nainstalovala se knihovna {0} do: {1}.
de: Die Bibliothek "{0}" wurde in "{1}" installiert.
pt_br: Biblioteca "{0}" instalada em "{1}"
ru: Библиотека "{0}" установлена в "{1}"
zh_hans: 已将库 "{0}" 安装到 "{1}"
zh_hant: 已將程式庫 "{0}" 安裝到 "{1}"

# UninstalledLibrary
source: Uninstalled library "{0}"
cs: Odinstalovala se knihovna {0}.
de: Bibliothek "{0}" deinstalliert
pt_br: Biblioteca "{0}" desinstalada
ru: Библиотека "{0}" удалена
zh_hans: 已卸载库 "{0}"
zh_hant: 已將程式庫 "{0}" 解除安裝

# InvalidFilesForLibrary
source: Library "{0}" does not contain the following files: {1}
cs: Knihovna {0} neobsahuje následující soubory: {1}
de: In der Bibliothek "{0}" sind die folgenden Dateien nicht enthalten: {1}
pt_br: A biblioteca "{0}" não contém os seguintes arquivos: {1}
ru: Библиотека "{0}" не содержит следующих файлов: {1}
zh_hans: 库 "{0}" 不包含以下文件: {1}
zh_hant: 程式庫 "{0}" 未包含下列檔案: {1}

# LibraryCannotBeInstalledDueToConflictingLibraries
source: Library "{0}" cannot be installed. "{1}" is already installed at "{2}". Please specify a different destination.
cs: Knihovnu {0} nejde nainstalovat. V {2} už je nainstalovaná knihovna {1}. Zadejte prosím jiný cíl.
de: Die Bibliothek "{0}" kann nicht installiert werden. "{1}" ist bereits in "{2}" installiert. Geben Sie ein anderes Ziel an.
pt_br: A biblioteca "{0}" não pode ser instalada. "{1}" já está instalada em "{2}". Especifique outro destino.
ru: Невозможно установить библиотеку "{0}". Библиотека "{1}" уже установлена в каталоге "{2}". Укажите другое место назначения.
zh_hans: 无法安装库 "{0}"。"{1}" 已安装在 "{2}" 上。 请指定其他目标。
zh_hant: 無法安裝程式庫 "{0}"。"{1}" 已安裝於 "{2}"。 請指定其他目的地。

# LibraryIdRequiredForUpdate
source: LibraryId is required for update
cs: Při aktualizaci se vyžaduje LibraryId.
de: LibraryId ist für Aktualisierung erforderlich.
pt_br: É necessário o LibraryIdpara atualizar
ru: Для обновления требуется идентификатор библиотеки
zh_hans: 需要 LibraryId 才能更新
zh_hant: 必須更新 LibraryId

# SpecifyDifferentDestination
source: Please specify a different destination.
cs: Zadejte prosím jiný cíl.
de: Geben Sie ein anderes Ziel an.
pt_br: Especifique outro destino.
ru: Укажите другое место назначения.
zh_hans: 请指定其他目标。
zh_hant: 請指定其他目的地。

# UninstallFailed
source: Failed to uninstall "{0}"
cs: Nepodařilo se odinstalovat: {0}.
de: Fehler beim Deinstallierne von "{0}".
pt_br: Falha ao desinstalar "{0}"
ru: Не удалось удалить "{0}"
zh_hans: 未能卸载 "{0}"
zh_hant: 無法將 "{0}" 解除安裝

# UpdateLibraryFailed
source: Failed to update "{0}" to "{1}"
cs: {0} – nepodařilo se aktualizovat na: {1}
de: Fehler beim Aktualisieren von "{0}" auf "{1}".
pt_br: Falha ao atualizar "{0}" para "{1}"
ru: Не удалось обновить "{0}" до "{1}"
zh_hans: 未能将 "{0}" 更新为 "{1}"
zh_hant: 無法將 "{0}" 更新為 "{1}"

# UpdateLibraryToLatestFailed
source: Failed to update "{0}" to latest
cs: Položku {0} se nepodařilo aktualizovat na nejnovější verzi.
de: Fehler beim Aktualisieren von "{0}" auf die neueste Version.
pt_br: Falha ao atualizar "{0}" para a versão mais recente
ru: Не удалось обновить "{0}" до последней версии
zh_hans: 未能将 "{0}" 更新到最新版本
zh_hant: 無法將 "{0}" 更新為最新

# LibraryUpdated
source: Updated "{0}" to "{1}"
cs: {0} – aktualizováno na: {1}
de: "{0}" auf "{1}" aktualisiert
pt_br: "{0}" atualizado para "{1}"
ru: "{0}" обновлено до "{1}"
zh_hans: 已将 "{0}" 更新为 "{1}"
zh_hant: 已將 "{0}" 更新為 "{1}"

# UnableToFindLatestVersionForLibrary
source: Could not determine the latest version for "{0}"
cs: Nešlo určit nejnovější verzi pro: {0}.
de: Die neueste Version für "{0}" konnte nicht bestimmt werden.
pt_br: Não foi possível determinar a versão mais recente para "{0}"
ru: Не удалось определить последнюю версию "{0}"
zh_hans: 无法确定 "{0}" 的最新版本
zh_hant: 無法判斷 "{0}" 的最新版本

# InitFailedUnknownProvider
source: Failed to initialize libman.json. [{0}]: {1}
cs: Libman.json se nepodařilo inicializovat. [{0}]: {1}
de: Fehler beim Initialisieren von "libman.json". [{0}]: {1}
pt_br: Falha ao inicializar o libman.json. [{0}]: {1}
ru: Не удалось инициализировать файл libman.json. [{0}]: {1}
zh_hans: 无法初始化 libman. json。[{0}]: {1}
zh_hant: 無法將 libman.json 初始化。[{0}]: {1}

# NonInteractiveConsoleMessage
source: Cannot prompt for user input in this console.
cs: V této konzole nejde vyzvat uživatele k zadání vstupu.
de: In dieser Konsole ist keine Benutzereingabe möglich.
pt_br: Não é possível solicitar a entrada do usuário neste console.
ru: Невозможно запросить входные данные у пользователя в этой консоли.
zh_hans: 无法在此控制台中提示用户输入。
zh_hant: 無法在此主控台提示使用者輸入。

# SpecifyDisabmiguatedLibrary
source: Please specify the complete library id and the also the provider using '--provider' option.
cs: Zadejte prosím úplné ID knihovny a také zprostředkovatele pomocí přepínače --provider.
de: Bitte geben Sie die vollständige Bibliotheks-ID und den Anbieter mit der "--Provider"-Option an.
pt_br: Especifique a ID da biblioteca completa e também o provedor usando a opção '--provider'.
ru: Укажите полный идентификатор библиотеки, а также укажите поставщика с помощью параметра "--provider".
zh_hans: 请指定完整的库 ID，并使用 “--provider” 选项指定提供程序。
zh_hant: 請使用 '--provider' 選項指定完整的程式庫識別碼及提供者。

# SpecifyFieldUsingOption
source: Please specify '{0}' using the '--{1}' option.
cs: Zadejte prosím parametr {0} pomocí přepínače --{1}.
de: Bitte geben Sie "{0}" mit der Option "--{1}" an.
pt_br: Especifique '{0}' usando a opção '--{1}'.
ru: Укажите "{0}" с помощью параметра "--{1}".
zh_hans: 请使用 “--{1}” 选项指定“{0}”。
zh_hant: 請使用 '--{1}' 選項指定 '{0}'。

# ConfigCommand_Description
source: Gets or sets configuration settings
cs: Načte nebo nastaví nastavení konfigurace.
de: Hiermit werden Konfigurationseinstellungen abgerufen oder festgelegt.
zh_hans: 获取或设置配置设置

# ConfigCommand_Examples
source: libman config http_proxy libman config --set http_proxy=http://example libman config --setEncrypted http_proxy.password=passwordText
de: libman config http_proxy libman config --set http_proxy=http://beispiel libman config --setEncrypted http_proxy.password=kennwortText

# ConfigCommand_ArgumentDescription
source: Name of the setting to retrieve
cs: Název nastavení, které se má načíst
de: Name der abzurufenden Einstellung
zh_hans: 要检索的设置的名称

# ConfigCommand_Error_KeyNotFound
source: Key {0} not found.
cs: Klíč {0} se nenašel.
de: Schlüssel "{0}" nicht gefunden.
zh_hans: 未找到密钥 {0}

# ConfigCommand_Error_ConflictingParameters
source: Cannot read and write settings in the same operation
cs: Nastavení nelze číst a zapisovat ve stejné operaci.
de: Einstellungen können nicht im selben Vorgang gelesen und geschrieben werden.
zh_hans: 无法在同一操作中读取和写入设置

# ConfigCommand_OptionDescription_Set
source: Sets a key-value pair in the configuration store. The option should be in the form key=value
cs: Nastaví do úložiště konfigurací pár klíč-hodnota. Tato možnost by měla být ve tvaru klíč=hodnota.
de: Legt ein Schlüssel-Wert-Paar im Konfigurationsspeicher fest. Die Option muss das Format "Schlüssel=Wert" aufweisen.
zh_hans: 在配置存储区中设置键值对。 此选项应采用 "键=值" 格式

# ConfigCommand_OptionDescription_SetEncrypted
source: Sets a key with an encrypted value in the configuraiton store. The option should be in the form key=plaintext
cs: Nastaví do úložiště konfigurací klíč s šifrovanou hodnotou. Tato možnost by měla být ve tvaru klíč=prostý_text
de: Legt einen Schlüssel mit einem verschlüsselten Wert im Konfigurationsspeicher fest. Die Option muss das Format "Schlüssel=nurText" aufweisen.
zh_hans: 在配置存储区中设置具有加密值的键。 此选项应采用 "键=纯文本" 格式

# ConfigCommand_Remarks
source: Settings cannot be read and stored in the same operation. To remove a setting, set it to an empty string (--set key=). Retrieving decrypted values for encrypted settings is not supported.
cs: Nastavení nelze číst a ukládat ve stejné operaci. Pokud chcete nastavení odebrat, nastavte je na prázdný řetězec (--set key=). Načítání dešifrovaných hodnot pro šifrované nastavení se nepodporuje.
de: Einstellungen können nicht im selben Vorgang gelesen und gespeichert werden. Um eine Einstellung zu entfernen, legen Sie sie auf eine leere Zeichenfolge fest (--set key=). Das Abrufen entschlüsselter Werte für verschlüsselte Einstellungen wird nicht unterstützt.
zh_hans: 无法在同一操作中读取和保存设置。 要删除某个设置，请将其设置为空字符串(--set key=)。 不支持检索已加密设置的解密值。
